Revit 2026 API

# InstanceBinding Constructor

---

Constructs an empty instance binding.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InstanceBinding()
```
```vb
Public Sub New
```
```cpp
public:
InstanceBinding()
```
```fsharp
new : unit -> InstanceBinding
```

Categories can be set a later time by using the Categories property of this object.

#### Reference

InstanceBinding Class

InstanceBinding Overload

Autodesk.Revit.DB Namespace